## M10 - Data Cleaning

- Data in real life is dirty
- Cleaning data is not an exact process
- Data needs to be clean to do machine learning (simpson's paradox)
- Data cleaning is time consuming but necessary

## Remove duplicates

In [1]:
import pandas as pd

df = pd.read_csv("employees.csv")

In [2]:
df.head()

,First Name,Gender,Start Date,Last Login Time,Salary,Bonus %,Senior Management,Team
0,Douglas,Male,8/6/1993,12:42 PM,97308,6.945,True,Marketing
1,Thomas,Male,3/31/1996,6:53 AM,61933,4.170,True,NaN
2,Maria,Female,4/23/1993,11:17 AM,130590,11.858,False,Finance
3,Jerry,Male,3/4/2005,1:00 PM,138705,9.340,True,Finance
4,Larry,Male,1/24/1998,4:47 PM,101004,1.389,True,Client Services

In [3]:
df.shape

(1000, 8)

In [4]:
df.sort_values("First Name")

,First Name,Gender,Start Date,Last Login Time,Salary,Bonus %,Senior Management,Team
101,Aaron,Male,2/17/2012,10:20 AM,61602,11.849,True,Marketing
327,Aaron,Male,1/29/1994,6:48 PM,58755,5.097,True,Marketing
440,Aaron,Male,7/22/1990,2:53 PM,52119,11.343,True,Client Services
937,Aaron,NaN,1/22/1986,7:39 PM,63126,18.424,False,Client Services
137,Adam,Male,5/21/2011,1:45 AM,95327,15.120,False,Distribution
...,...,...,...,...,...,...,...,...
902,NaN,Male,5/23/2001,7:52 PM,103877,6.322,NaN,Distribution
925,NaN,Female,8/23/2000,4:19 PM,95866,19.388,NaN,Sales
946,NaN,Female,9/15/1985,1:50 AM,133472,16.941,NaN,Distribution
947,NaN,Male,7/30/2012,3:07 PM,107351,5.329,NaN,Marketing
951,NaN,Female,9/14/2010,5:19 AM,143638,9.662,NaN,NaN

In [5]:
df.drop_duplicates(subset="First Name", keep="first").sort_values("First Name")

,First Name,Gender,Start Date,Last Login Time,Salary,Bonus %,Senior Management,Team
101,Aaron,Male,2/17/2012,10:20 AM,61602,11.849,True,Marketing
137,Adam,Male,5/21/2011,1:45 AM,95327,15.120,False,Distribution
53,Alan,NaN,3/3/2014,1:28 PM,40341,17.578,True,Finance
372,Albert,Male,2/1/1997,4:20 PM,67827,19.717,True,Engineering
425,Alice,Female,5/2/1986,1:50 AM,51395,2.378,True,Finance
...,...,...,...,...,...,...,...,...
433,Wanda,Female,7/20/2008,1:44 PM,65362,7.132,True,Legal
177,Wayne,Male,4/7/2012,8:00 AM,102652,14.085,True,Distribution
127,William,Male,9/29/2002,4:09 PM,66521,5.830,False,Human Resources
112,Willie,Male,11/27/2003,6:21 AM,64363,4.023,False,Marketing
7,NaN,Female,7/20/2015,10:43 AM,45906,11.598,NaN,Finance

In [6]:
df.head()

,First Name,Gender,Start Date,Last Login Time,Salary,Bonus %,Senior Management,Team
0,Douglas,Male,8/6/1993,12:42 PM,97308,6.945,True,Marketing
1,Thomas,Male,3/31/1996,6:53 AM,61933,4.170,True,NaN
2,Maria,Female,4/23/1993,11:17 AM,130590,11.858,False,Finance
3,Jerry,Male,3/4/2005,1:00 PM,138705,9.340,True,Finance
4,Larry,Male,1/24/1998,4:47 PM,101004,1.389,True,Client Services

In [7]:
df.dtypes

First Name            object
Gender                object
Start Date            object
Last Login Time       object
Salary                 int64
Bonus %              float64
Senior Management     object
Team                  object
dtype: object

In [8]:
df.shape

(1000, 8)

In [9]:
df.loc[1001] = [df["First Name"][442],
                df["Gender"][442],
                df["Start Date"][442],
                df["Last Login Time"][442],
                df["Salary"][442],
                df["Bonus %"][442],
                df["Senior Management"][442],
                df["Team"][442]]

In [10]:
df.loc[442]

First Name               Julie
Gender                  Female
Start Date           4/23/1998
Last Login Time        5:52 AM
Salary                   73437
Bonus %                  2.518
Senior Management         True
Team                   Finance
Name: 442, dtype: object

In [11]:
df.loc[1001]

First Name               Julie
Gender                  Female
Start Date           4/23/1998
Last Login Time        5:52 AM
Salary                   73437
Bonus %                  2.518
Senior Management         True
Team                   Finance
Name: 1001, dtype: object

In [12]:
# Drop duplicates 
df.drop_duplicates(keep="first", inplace=True)

In [13]:
df.loc[1001]

KeyError: 1001

In [14]:
df.dtypes

First Name            object
Gender                object
Start Date            object
Last Login Time       object
Salary                 int64
Bonus %              float64
Senior Management     object
Team                  object
dtype: object

## Removing useless columns

In [15]:
from numpy import loadtxt
df = loadtxt("oil-spill.csv", delimiter=",")

### Delete columns that contain a single value

In [17]:
from numpy import unique

for i in range(df.shape[1]):
    print(i, len(unique(df[:, i])))

0 238
1 297
2 927
3 933
4 179
5 375
6 820
7 618
8 561
9 57
10 577
11 59
12 73
13 107
14 53
15 91
16 893
17 810
18 170
19 53
20 68
21 9
22 1
23 92
24 9
25 8
26 9
27 308
28 447
29 392
30 107
31 42
32 4
33 45
34 141
35 110
36 3
37 758
38 9
39 9
40 388
41 220
42 644
43 649
44 499
45 2
46 937
47 169
48 286
49 2

In [18]:
df = pd.read_csv("oil-spill.csv", header=None)

In [19]:
df.nunique()

0     238
1     297
2     927
3     933
4     179
5     375
6     820
7     618
8     561
9      57
10    577
11     59
12     73
13    107
14     53
15     91
16    893
17    810
18    170
19     53
20     68
21      9
22      1
23     92
24      9
25      8
26      9
27    308
28    447
29    392
30    107
31     42
32      4
33     45
34    141
35    110
36      3
37    758
38      9
39      9
40    388
41    220
42    644
43    649
44    499
45      2
46    937
47    169
48    286
49      2
dtype: int64

In [20]:
counts = df.nunique()

In [21]:
counts = df.nunique()
to_delete = [i for i,v in enumerate(counts) if v == 1]

In [22]:
to_delete

[22]

In [23]:
df.drop(to_delete, axis=1, inplace=True)

In [24]:
df.shape

(937, 49)

## Work with missing data

In [25]:
import numpy as np

In [26]:
dic = {"Col1": [100,90, np.nan, 20],
       "Col2": [40, 56, 32, np.nan],
       "Col3": [np.nan, 40, 60, 12]}

In [27]:
df = pd.DataFrame(dic)

In [28]:
df.head()

    Col1  Col2  Col3
0  100.0  40.0   NaN
1   90.0  56.0  40.0
2    NaN  32.0  60.0
3   20.0   NaN  12.0

In [32]:
df["Col1"].mean()

70.0

In [29]:
df.isnull()

    Col1   Col2   Col3
0  False  False   True
1  False  False  False
2   True  False  False
3  False   True  False

In [30]:
df.isnull().any()

Col1    True
Col2    True
Col3    True
dtype: bool

In [31]:
df.isnull().any().any()

True

In [33]:
df.notnull()

    Col1   Col2   Col3
0   True   True  False
1   True   True   True
2  False   True   True
3   True  False   True

In [34]:
# Remove missing values
df.dropna(how="any") # by default

   Col1  Col2  Col3
1  90.0  56.0  40.0

In [35]:
df.head()

    Col1  Col2  Col3
0  100.0  40.0   NaN
1   90.0  56.0  40.0
2    NaN  32.0  60.0
3   20.0   NaN  12.0

In [36]:
# Remove missing values
df.dropna(how="all")

    Col1  Col2  Col3
0  100.0  40.0   NaN
1   90.0  56.0  40.0
2    NaN  32.0  60.0
3   20.0   NaN  12.0

In [37]:
# Remove missing values in columns (not usual, don't do it like this)
df.dropna(how="any", axis=1)

Empty DataFrame
Columns: []
Index: [0, 1, 2, 3]

In [ ]:
# Remove missing values in columns (not usual, don't do it like this)
df.dropna(how="all", axis=1)

In [38]:
# Fill the missing values with a constant
df.fillna(0)

    Col1  Col2  Col3
0  100.0  40.0   0.0
1   90.0  56.0  40.0
2    0.0  32.0  60.0
3   20.0   0.0  12.0

In [39]:
# Fill the missing values with the previous value
df.fillna(method="pad")

    Col1  Col2  Col3
0  100.0  40.0   NaN
1   90.0  56.0  40.0
2   90.0  32.0  60.0
3   20.0  32.0  12.0

In [40]:
# Fill the missing values with the next value
df.fillna(method="bfill")

    Col1  Col2  Col3
0  100.0  40.0  40.0
1   90.0  56.0  40.0
2   20.0  32.0  60.0
3   20.0   NaN  12.0

In [41]:
# Filling with different values
df.fillna(value={"Col1":0, "Col2":2, "Col3":4})

    Col1  Col2  Col3
0  100.0  40.0   4.0
1   90.0  56.0  40.0
2    0.0  32.0  60.0
3   20.0   2.0  12.0

In [42]:
df

    Col1  Col2  Col3
0  100.0  40.0   NaN
1   90.0  56.0  40.0
2    NaN  32.0  60.0
3   20.0   NaN  12.0

In [43]:
# Interpolate the missing values
df.interpolate(method="linear", limit_direction="forward")

    Col1  Col2  Col3
0  100.0  40.0   NaN
1   90.0  56.0  40.0
2   55.0  32.0  60.0
3   20.0  32.0  12.0

In [45]:
df.interpolate?

In [44]:
(90+20)/2

55.0

In [48]:
# Impute the missing values
from sklearn.impute import SimpleImputer
from numpy import nan

imputer = SimpleImputer(missing_values=nan, strategy="mean")

df_transformed = imputer.fit_transform(df)

In [49]:
df_transformed

array([[100.        ,  40.        ,  37.33333333],
       [ 90.        ,  56.        ,  40.        ],
       [ 70.        ,  32.        ,  60.        ],
       [ 20.        ,  42.66666667,  12.        ]])